---
kind: type
id: T:Autodesk.Revit.DB.LightNode
source: html/3904e399-f67a-a111-d963-5f91665b233c.htm
---
# Autodesk.Revit.DB.LightNode

This class represents a Light element in a model-exporting process.

## Syntax (C#)
```csharp
public class LightNode : ContentNode
```

## Remarks
See also: OnLight(LightNode) .